# Decision Tree Classifier
## Mohammad Sulaiman Behzad

In [31]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.tree import DecisionTreeClassifier

In [32]:
X_train = pd.read_csv('train.csv', header=None, skiprows=[0])
X_test = pd.read_csv('test.csv', header=None, skiprows=[0])
Y_train = pd.read_csv('train_labels.csv',header=None, skiprows=[0])
Y_test = pd.read_csv('test_labels.csv', header=None, skiprows=[0])

In [33]:
X_train.shape

(800, 11)

In [34]:
X_test.shape

(91, 11)

In [35]:
X_train.describe()

,0,1,4,5,6,7,8
count,800.000000,800.000000,640.000000,800.000000,800.000000,5.890000e+02,800.000000
mean,447.867500,2.311250,29.632031,0.541250,0.387500,2.649668e+05,32.592395
std,258.858126,0.835312,14.617948,1.139044,0.811275,4.819212e+05,50.726982
min,1.000000,1.000000,0.670000,0.000000,0.000000,6.950000e+02,0.000000
25%,224.750000,2.000000,20.000000,0.000000,0.000000,2.416000e+04,7.925000
50%,449.500000,3.000000,28.000000,0.000000,0.000000,2.361710e+05,14.500000
75%,677.250000,3.000000,38.000000,1.000000,0.000000,3.477430e+05,31.275000
max,891.000000,3.000000,80.000000,8.000000,6.000000,3.101298e+06,512.329200

In [36]:
print(X_train.isnull().sum())

0       0
1       0
2       0
3       0
4     160
5       0
6       0
7     211
8       0
9     617
10      0
dtype: int64

In [37]:
X_test

,0,1,2,3,4,5,6,7,8,9,10
0,373,3,"Beavan, Mr. William Thomas",male,19.0,0,0,323951.0,8.0500,NaN,S
1,22,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698.0,13.0000,D56,S
2,714,3,"Larsson, Mr. August Viktor",male,29.0,0,0,7545.0,9.4833,NaN,S
3,648,1,"Simonius-Blumer, Col. Oberst Alfons",male,56.0,0,0,13213.0,35.5000,A26,C
4,59,2,"West, Miss. Constance Mirium",female,5.0,1,2,NaN,27.7500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
86,316,3,"Nilsson, Miss. Helmina Josefina",female,26.0,0,0,347470.0,7.8542,NaN,S
87,781,3,"Ayoub, Miss. Banoura",female,13.0,0,0,2687.0,7.2292,NaN,C
88,587,2,"Jarvis, Mr. John Denzil",male,47.0,0,0,237565.0,15.0000,NaN,S
89,424,3,"Danbom, Mrs. Ernst Gilbert (Anna Sigrid Maria ...",female,28.0,1,1,347080.0,14.4000,NaN,S
90,432,3,"Thorneycroft, Mrs. Percival (Florence Kate White)",female,NaN,1,0,376564.0,16.1000,NaN,S

In [38]:
X_train = X_train.drop([0, 2, 9], axis=1)
X_test = X_test.drop([0, 2, 9], axis=1)
X_train.head()

   1       3     4   5   6         7        8  10
0   3  female  63.0   0   0    4134.0   9.5875  S
1   1  female  63.0   1   0   13502.0  77.9583  S
2   3    male  51.0   0   0   21440.0   8.0500  S
3   3    male  51.0   0   0  347743.0   7.0542  S
4   3  female  38.0   1   5  347077.0  31.3875  S

In [39]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
le.fit(X_train[3])

LabelEncoder()

In [40]:
le.classes_

array(['female', 'male'], dtype=object)

In [41]:
x_tr_3 = le.transform(X_train[3])

In [42]:
x_tr_3

array([0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0,
       1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1,
       0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1,
       1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0,
       1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0,
       0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1,
       1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0,
       1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1,
       1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1,
       1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1,
       0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1,
       1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1,
       1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1,
       0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1,
       1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1,
       0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0,
       0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1,
       1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1,
       1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1,
       0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1,
       0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1,
       0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1,
       0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0,
       0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0,
       1, 1, 1, 0, 1, 1, 1, 1])

In [43]:
X_train[3] = x_tr_3
print(X_train)

     1   3     4   5   6         7        8  10
0     3   0  63.0   0   0    4134.0   9.5875  S
1     1   0  63.0   1   0   13502.0  77.9583  S
2     3   1  51.0   0   0   21440.0   8.0500  S
3     3   1  51.0   0   0  347743.0   7.0542  S
4     3   0  38.0   1   5  347077.0  31.3875  S
..   ..  ..   ...  ..  ..       ...      ... ..
795   2   0  55.0   0   0  248706.0  16.0000  S
796   1   1  47.0   0   0    5727.0  25.5875  S
797   3   1  26.0   0   0    3474.0   7.8875  S
798   3   1  18.0   1   1  370129.0  20.2125  S
799   1   1  51.0   0   1       NaN  61.3792  C

[800 rows x 8 columns]

In [44]:
le.fit(X_test[3])

LabelEncoder()

In [45]:
x_te_3 = le.transform(X_test[3])
X_test[3] = x_te_3
X_test.head()

   1   3     4   5   6         7        8  10
0   3   1  19.0   0   0  323951.0   8.0500  S
1   2   1  34.0   0   0  248698.0  13.0000  S
2   3   1  29.0   0   0    7545.0   9.4833  S
3   1   1  56.0   0   0   13213.0  35.5000  C
4   2   0   5.0   1   2       NaN  27.7500  S

In [46]:
le.fit(X_train[10])
le.classes_

array(['C', 'Q', 'S'], dtype=object)

In [47]:
x_tr_10 = le.transform(X_train[10])
x_tr_10

array([2, 2, 2, 2, 2, 2, 0, 2, 1, 2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0,
       0, 1, 2, 0, 2, 2, 0, 0, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       0, 2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2,
       2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2,
       0, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 2, 1, 2, 1, 0, 2, 1, 2, 0, 0,
       2, 1, 2, 1, 2, 2, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 2, 2, 2, 1, 2, 2,
       2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 1, 0, 1, 2, 1, 2, 0, 0,
       0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 0,
       2, 2, 2, 2, 0, 2, 2, 2, 2, 1, 2, 2, 2, 2, 1, 2, 2, 2, 0, 0, 0, 2,
       0, 2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 0, 1, 2, 1, 0, 2, 1, 2, 1, 1, 2,
       2, 2, 2, 1, 2, 2, 2, 0, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 0, 2, 2,
       2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 2, 2, 2, 2, 2,
       2, 1, 2, 2, 1, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 1, 0, 2, 1, 0, 2, 2, 0, 2, 2, 1, 0, 0, 2, 0, 2, 2, 1, 2, 2, 0,
       2, 0, 0, 2, 2, 2, 2, 2, 0, 2, 1, 2, 0, 2, 2, 2, 2, 2, 2, 2, 1, 2,
       2, 1, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 1, 2, 1, 2, 2,
       2, 1, 2, 0, 0, 2, 2, 2, 2, 2, 2, 0, 0, 1, 2, 2, 2, 2, 2, 2, 2, 2,
       0, 0, 2, 0, 2, 0, 1, 0, 2, 2, 2, 0, 1, 2, 2, 2, 2, 0, 2, 2, 2, 2,
       2, 0, 2, 0, 2, 0, 2, 2, 2, 2, 1, 2, 2, 2, 0, 0, 2, 2, 2, 0, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 0, 1, 2, 2, 2, 2, 0, 0, 2,
       1, 2, 0, 2, 2, 2, 0, 1, 2, 2, 0, 0, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 1, 2, 0, 2, 2, 0, 2, 2,
       1, 0, 2, 2, 2, 0, 2, 2, 0, 1, 0, 2, 2, 2, 1, 2, 0, 2, 2, 2, 0, 0,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 1, 1, 0, 2, 0, 0, 2, 2, 2, 0,
       0, 2, 2, 2, 2, 2, 2, 0, 2, 0, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 1, 2,
       2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 1, 1, 2, 1, 2, 2,
       2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 0, 2, 0, 2, 2, 2, 2, 0, 0, 2, 1,
       2, 1, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2,
       0, 1, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 1, 0, 2, 2, 0, 2, 0, 2, 1, 2, 0, 0, 2, 2, 2,
       1, 2, 2, 2, 2, 2, 2, 1, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 1,
       2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 1, 0, 0, 2, 2,
       0, 0, 0, 0, 2, 2, 2, 2, 2, 1, 0, 2, 0, 0, 2, 2, 2, 1, 2, 2, 2, 2,
       2, 0, 2, 2, 2, 2, 2, 0])

In [48]:
X_train[10] = x_tr_10
X_train.head()

   1   3     4   5   6         7        8   10
0   3   0  63.0   0   0    4134.0   9.5875   2
1   1   0  63.0   1   0   13502.0  77.9583   2
2   3   1  51.0   0   0   21440.0   8.0500   2
3   3   1  51.0   0   0  347743.0   7.0542   2
4   3   0  38.0   1   5  347077.0  31.3875   2

In [49]:
le.fit(X_test[10])

LabelEncoder()

In [50]:
x_te_10 = le.transform(X_test[10])
X_test[10] = x_te_10
X_test.head()

   1   3     4   5   6         7        8   10
0   3   1  19.0   0   0  323951.0   8.0500   2
1   2   1  34.0   0   0  248698.0  13.0000   2
2   3   1  29.0   0   0    7545.0   9.4833   2
3   1   1  56.0   0   0   13213.0  35.5000   0
4   2   0   5.0   1   2       NaN  27.7500   2

## Handle null values

In [51]:
from numpy import nan
X_train.fillna(X_train.mean(), inplace=True)
X_test.fillna(X_test.mean(), inplace=True)

In [52]:
print(X_train.isnull().sum())

1     0
3     0
4     0
5     0
6     0
7     0
8     0
10    0
dtype: int64

In [53]:
print(X_test.isnull().sum())

1     0
3     0
4     0
5     0
6     0
7     0
8     0
10    0
dtype: int64

In [54]:
classifier = DecisionTreeClassifier(criterion="gini",max_depth=3,min_samples_split=5, min_samples_leaf=3, random_state=0, splitter='best')
classifier.fit(X_train, Y_train)

DecisionTreeClassifier(max_depth=3, min_samples_leaf=3, min_samples_split=5,
                       random_state=0)

In [55]:
y_predict_train = classifier.predict(X_train)

In [56]:
from sklearn import metrics
print('Mean Absolute Error:', metrics.mean_absolute_error(Y_train, y_predict_train))
print('Mean Squared Error:', metrics.mean_squared_error(Y_train, y_predict_train))
print('Root Mean Squared Error:', np.sqrt(metrics.mean_squared_error(Y_train, y_predict_train)))
print('Accuracy: ', metrics.accuracy_score(Y_train, y_predict_train.round()))

Mean Absolute Error: 0.1675
Mean Squared Error: 0.1675
Root Mean Squared Error: 0.40926763859362253
Accuracy:  0.8325

In [57]:
y_predict = classifier.predict(X_test)
y_predict

array([0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1], dtype=int64)

In [58]:
print('Mean Absolute Error:', metrics.mean_absolute_error(Y_test, y_predict))
print('Mean Squared Error:', metrics.mean_squared_error(Y_test, y_predict))
print('Root Mean Squared Error:', np.sqrt(metrics.mean_squared_error(Y_test, y_predict)))
print('Accuracy: ', metrics.accuracy_score(Y_test, y_predict.round()))

Mean Absolute Error: 0.18681318681318682
Mean Squared Error: 0.18681318681318682
Root Mean Squared Error: 0.4322189107537832
Accuracy:  0.8131868131868132